[
  {
    "question_id": "2016_P1_Q03",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2016,
    "paper": "P1",
    "question_no": 3,
    "question_type": "MCQ",
    "stem": "Mr. Ng, a Hong Kong citizen, is going to travel to Tokyo for leisure. Which of the following will decrease his cost of having the trip?",
    "options": {
      "A": "A typhoon is approaching Tokyo right before his trip.",
      "B": "His boss is going to treat all the staff to a free buffet during his leave.",
      "C": "The scenery in Tokyo is better than he expected.",
      "D": "Japanese Yen depreciates against other currencies."
    },
    "correct_option": "D",
    "explanation": "Step 1: Identify the concept. The cost of a trip includes monetary costs (e.g. exchange rate) and possibly time/opportunity costs; changes that lower required.\n\nStep 2: Analyse the scenario. Mr spending reduce the cost Ng is travelling to Tokyo; the question asks what decreases his cost.\n\nStep 3: Evaluate the options. A and C affect benefits/utility, not cost. B is a separate free meal at home, not a reduction in the resources spent on the trip. If the Japanese yen depreciates, each HK dollar buys more yen, so accommodation/food/transport in Japan become cheaper in HK$ terms.\n\nStep 4: Conclude. Choose D.",
    "correct_percentage": 76.0,
    "ability_dimension": "COST_STRUCTURE",
    "difficulty_level": 2,
    "cross_topic_ids": []
  },
  {
    "question_id": "2018_P1_Q02",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2018,
    "paper": "P1",
    "question_no": 2,
    "question_type": "MCQ",
    "stem": "The Chief Executive proposed to raise the recurrent education spending by $5$ billion. One of her proposals was to provide a $30000$ subsidy to eligible secondary school graduates studying self-financing programmes. The above proposal is related to the _______ question(s) in Economics.",
    "options": {
      "A": "'how to produce'",
      "B": "'for whom to produce'",
      "C": "'what to produce' and 'how to produce'",
      "D": "'what to produce' and 'for whom to produce'"
    },
    "correct_option": "D",
    "explanation": null,
    "correct_percentage": 81.0,
    "ability_dimension": "COST_STRUCTURE",
    "difficulty_level": 1,
    "cross_topic_ids": []
  },
  {
    "question_id": "2023_P1_Q01",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2023,
    "paper": "P1",
    "question_no": 1,
    "question_type": "MCQ",
    "stem": "Mr Cheung bought restaurant premises 2 years ago for $5000000$ and sells 'two-dish-rice' meal boxes at the premises. Recently, his monthly profit has decreased from $30000$ to $10000$ due to the opening of new restaurants nearby. A businessman offers to rent Mr Cheung's restaurant premises for a monthly rental of $15000$. Which of the following would be included in Mr Cheung's opportunity cost of continuing to operate his 'two-dish-rice' business at the premises?",
    "options": {
      "A": "the $5000000$ purchase price of the restaurant premises",
      "B": "the $10000$ monthly profit",
      "C": "the $15000$ monthly rental",
      "D": "the $20000$ drop in monthly profit"
    },
    "correct_option": "C",
    "explanation": "This question tests understanding of opportunity cost. Opportunity cost is the highest-valued option forgone when making a decision. The correct answer is C because it correctly applies these economic principles to the given scenario.",
    "correct_percentage": 84.0,
    "ability_dimension": "ALT_LOGIC",
    "difficulty_level": 2,
    "cross_topic_ids": []
  },
  {
    "question_id": "2019_P1_Q03",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2019,
    "paper": "P1",
    "question_no": 3,
    "question_type": "MCQ",
    "stem": "Mr Lo spent $60000$ on buying a second hand car three years ago. Suppose he can resell the car at $2000$. Alternatively, he needs to spend $5000$ on repairing the car before he can continue to use it. What is his cost of continuing to use the car?",
    "options": {
      "A": "$2000$",
      "B": "$5000$",
      "C": "$7000$",
      "D": "$60000$"
    },
    "correct_option": "C",
    "explanation": "The correct answer is C.",
    "correct_percentage": 55.0,
    "ability_dimension": "SUNK_FILTER",
    "difficulty_level": 3,
    "cross_topic_ids": []
  },
  {
    "question_id": "2025_P1_Q01",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2025,
    "paper": "P1",
    "question_no": 1,
    "question_type": "MCQ",
    "stem": "Susan planned to watch a concert and bought a ticket of the concert for $1500$. Soon after Susan bought the ticket, a company offered to pay her $3000$ for a part-time job. However, the work hours of the parttime job clashed with the time of the concert. At the same time, as all tickets were sold out, her friend offered to buy her concert ticket for $1800$.\n\nBased on the above information, at the time when Susan was deciding whether to sell the concert ticket to her friend, her opportunity cost of choosing to watch the concert would be _______ .\nA. $3300$\nB. $4500$\nC. $4800$\nD. $6300$",
    "options": {
      "A": "$3300$",
      "B": "$4500$",
      "C": "$4800$",
      "D": "$6300$"
    },
    "correct_option": "C",
    "explanation": "Step 1: Identify what opportunity cost means - it's the highest-valued option forgone when making a choice.\n\nStep 2: At the decision point, Susan has two options:\n- Option 1: Watch the concert (forgoes $3000 job + $1800 ticket sale = $4800)\n- Option 2: Sell ticket and take job (forgoes watching the concert)\n\nStep 3: The $1500 already paid for the ticket is a sunk cost - it cannot be recovered regardless of the decision. Sunk costs should not be included in opportunity cost calculations.\n\nStep 4: Opportunity cost of watching the concert = sum of all benefits forgone = $3000 (job) + $1800 (ticket sale) = $4800.\n\nTherefore, the answer is C: $4800.",
    "correct_percentage": 66.0,
    "ability_dimension": "SUNK_FILTER",
    "difficulty_level": 2,
    "cross_topic_ids": []
  },
  {
    "question_id": "2022_P1_Q03",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2022,
    "paper": "P1",
    "question_no": 3,
    "question_type": "MCQ",
    "stem": "the following factors would LEAST likely affect the cost-benefit analysis for Tommy's career choice?\nA.\n\nTommy is planning for his future after his S. 6 graduation. He has several options and his order of preference is as follows. | First option: | Being a barista in a café | | :--- | :--- | | Second option: | Being a trainee in digital marketing | | Third option: | Being a junior fireman | Which of Coffee culture becomes more popular.",
    "options": {
      "A": "Coffee culture becomes more popular.",
      "B": "More companies expand their digital marketing departments.",
      "C": "The remuneration of junior firemen worsens.",
      "D": "Safety measures of fire-fighting are improved drastically."
    },
    "correct_option": "C",
    "explanation": "This question tests understanding of opportunity cost. Cost-benefit analysis compares the benefits and costs of different options. Factors that change the benefits or costs of any option affect the analysis. However, if an option is already the least preferred and becomes even less attractive, it may not significantly affect the comparison between the top options. The correct answer is C because it correctly applies these economic principles to the given scenario.",
    "correct_percentage": 37.0,
    "ability_dimension": "ALT_LOGIC",
    "difficulty_level": 4,
    "cross_topic_ids": []
  },
  {
    "question_id": "2014_P1_Q01",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2014,
    "paper": "P1",
    "question_no": 1,
    "question_type": "MCQ",
    "stem": "A famous football team, Manchester United, visited Hong Kong for a friendly match. The day before the match, the team found the pitch in the Hong Kong Stadium had been damaged by prolonged rain and it considered cancelling the match. The opportunity cost for Manchester United to continue playing in such a poor pitch would ______ because ______.",
    "options": {
      "A": "increase ... there was a higher chance for the players to get injured",
      "B": "increase ... the team was likely to have poor performance",
      "C": "remain unchanged ... the expense on the visit to Hong Kong had already been paid",
      "D": "remain unchanged ... the players spent the same amount of time in Hong Kong"
    },
    "correct_option": "A",
    "explanation": "Opportunity cost (機會成本) is the value of the next best alternative forgone. Continuing to play on a poor pitch increases the probability of player injuries. These potential injuries would lead to: (1) Higher medical expenses. (2) Players may miss subsequent games in Premier League and Champions League. (3) These are real costs that could be avoided by not playing. The extra costs (net of penalty for breach of contract) could be avoided if they chose not to play, so the opportunity cost INCREASES.",
    "correct_percentage": 32.0,
    "ability_dimension": "SUNK_FILTER",
    "difficulty_level": 4,
    "cross_topic_ids": []
  },
  {
    "question_id": "2015_P1_Q02",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2015,
    "paper": "P1",
    "question_no": 2,
    "question_type": "MCQ",
    "stem": "David can choose to take the MTR or a bus to Yuen Long. Suppose the required travel time and the fares of both options are the same in a normal situation. Which of the following will result in an increase in the opportunity cost of travelling to Yuen Long by MTR?",
    "options": {
      "A": "The air-conditioner on the bus is out of order.",
      "B": "The traffic jam makes the bus trip 15 minutes longer.",
      "C": "A signalling problem causes the travel time of the MTR to incre mase by 15inutes.",
      "D": "David feels annoyed about the news broadcast in the MTR train."
    },
    "correct_option": "C",
    "explanation": "Opportunity cost is the value of the next best alternative forgone. Initially, MTR and bus have equal time and fare. When the bus trip becomes longer (15 minutes more), the opportunity cost of taking the bus increases. This makes MTR relatively cheaper in comparison, so the opportunity cost of taking MTR actually decreases. Conversely, when MTR travel time increases by 15 minutes, the opportunity cost of taking MTR increases because David now gives up more time that could be spent on other activities.",
    "correct_percentage": 63.0,
    "ability_dimension": "ALT_LOGIC",
    "difficulty_level": 2,
    "cross_topic_ids": []
  },
  {
    "question_id": "2018_P1_Q03",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2018,
    "paper": "P1",
    "question_no": 3,
    "question_type": "MCQ",
    "stem": "John, a Secondary 6 graduate, is considering studying a programme either in Hong Kong or the Mainland. Which of the following situations would lower his opportunity cost of studying the programme in Hong Kong? (1) His tuition fee of the first year will be waived if he studies the programme in Hong Kong. (2) The graduates of the Mainland programme have better job prospects. (3) The qualification of the Mainland programme may not be recognised in Hong Kong.",
    "options": {
      "A": "(1) and (2) only",
      "B": "(1) and (3) only",
      "C": "(2) and (3) only",
      "D": "(1), (2) and (3)"
    },
    "correct_option": "B",
    "explanation": null,
    "correct_percentage": 80.0,
    "ability_dimension": "ALT_LOGIC",
    "difficulty_level": 1,
    "cross_topic_ids": []
  },
  {
    "question_id": "2021_P1_Q03",
    "topic_id": "1",
    "sub_topic_id": "1.2",
    "source_type": "PAST_PAPER",
    "year": 2021,
    "paper": "P1",
    "question_no": 3,
    "question_type": "MCQ",
    "stem": "After graduating from secondary school, Paul considers whether to become a full-time Key Opinion Leader (KOL) in social media channels or to become an e-sports player.",
    "options": {
      "A": "(1) and (2) only",
      "B": "(1) and (3) only",
      "C": "(2) and (3) only",
      "D": "(1), (2) and (3)"
    },
    "correct_option": "A",
    "explanation": "This question tests understanding of opportunity cost and factors affecting the cost of choosing one option over another. The cost of being a KOL decreases when: (1) Paul receives sponsored equipment (reduces monetary cost), or (2) the e-sports salary decreases (reduces the opportunity cost, i.e., what Paul gives up). Statement (3) - increased risk of hacker attacks - would INCREASE the cost/risk of being a KOL, not decrease it. The correct answer is A: (1) and (2) only.",
    "correct_percentage": 67.0,
    "ability_dimension": "COST_STRUCTURE",
    "difficulty_level": 3,
    "cross_topic_ids": []
  },
  {
    "question_id": "2024_P1_Q36",
    "topic_id": "4",
    "sub_topic_id": "1.3",
    "source_type": "PAST_PAPER",
    "year": 2024,
    "paper": "P1",
    "question_no": 36,
    "question_type": "MCQ",
    "stem": "| Nominal interest rate on bonds | $6 \\%$ | | :--- | :--- | | Expected inflation rate | $4 \\%$ | Based on the above information，the _______ of holding money is $6 \\%$ ，and the expected real rate of return of holding _______ is $-4 \\%$ ． A．cost 。。．money B．cost 。。．bonds C．nominal rate of return 。。．money D．nominal rate of return 。。bonds",
    "options": {
      "A": "cost 。。.money",
      "B": "cost 。。.bonds",
      "C": "nominal rate of return 。。.money",
      "D": "nominal rate of return 。。bonds"
    },
    "correct_option": "A",
    "explanation": "This question tests understanding of Interest and Information. The correct answer is A because it correctly applies economic principles to the given scenario.",
    "correct_percentage": 64.0,
    "ability_dimension": "COST_STRUCTURE",
    "difficulty_level": 2,
    "cross_topic_ids": ["1.2", "2.4", "7.3"]
  }
]
